{
  "about-me": {
    "name": "Ravi Akhouri",
    "email": "contact@raviakhouri.in",
    "phone": "+91 700-371-7376",
    "jobTitle": "Web Developer, Angular UI Developer",
    "address": "",
    "city": "string",
    "state": "string",
    "zip": "string",
    "country": "India",
    "summary": "Hello! I am very much passionate about coding. I'm working as a Frontend Developer Angular in IT Industries and also acheived recognitions for my Work. \nAlong with Angular, I have worked with HTML5, css, javaScript and typeScript. I have also used Bootstrap 4 and Angular Material.",
    "linkedin": "https://www.linkedin.com/in/ravi-akhouri-6696071a7/",
    "github": "https://github.com/RaviAkhouri30",
    "twitter": "",
    "dateOfBirth": "1997-03-30",
    "profilePic": "",
    "resume": "",
    "uid": "RS-1",
    "hobbies": [
      "Photography",
      "Gaming",
      "Coding",
      "Electronics"
    ],
    "awardsAndAchievements": [
      "Spot On MASTERMIND Award (in Mindtree) - 2 times",
      "Spot On TEAM - A Award (in Mindtree) - 2 times",
      "Award for Outstanding Performance in Q1(in Wipro)",
      "Achieved 3rd Rank in Tech Fest for Robocar in 2018."
    ]
  },
  "experience": [
    {
      "personUid": "RS-1",
      "uid": "work-exp-3",
      "companyName": "Siemens Technology and Services Pvt Ltd",
      "tenure": "February 2023 - Present",
      "desc": "Here in siemens, i started working in a project called as SystemOne, where my role was to developed the frontend on Angular. \n I have worked in multiple Applications such as ABTSite, ABTGo, BOSS Project Conversion and Performance Dashboard. \n I have mostly worked in the ABTSite Application and developed/enhanced modules such as View Favorites, KNX PL-Link, MBus, Function Configuration and Plant Configurator(From scratch) and few others etc. \n Apart from that I have also contributed in other project named Query Generator, which I have worked on UI enhancements and code refactoring."
    },
    {
      "personUid": "RS-1",
      "uid": "work-exp-2",
      "companyName": "Mindtree Ltd",
      "tenure": "August 2021 - January 2021",
      "desc": "I have worked for Aflac-Business Services (An American Based Insurance Company). My Role and Responsibility is pretty much like previous Projects. \n I have worked in one of the TVS Motors-PIP App (A Product Based Company into Automobiles (2, 3 wheelers Vehicle)), where We were given the responsibility to build the frontend application from scratch. I have implemented the login (Authentication), business logic, interceptors, validations and UI design for both desktop and mobile view along with integration of rest API’s. We have also used the oops concept to make the code more reliable, readable and understandable. \nThe full form of Application is Profit Improvement Plan (PIP), through this application, there Employees will be able to suggest changes, which will lead to production cost reduction and increased profits. The Suggestions will go through an approval process including finance approval and department approvals.\n Before this, I worked with Sennheiser-EPOS Manager (A Product Based Company into Audio Devices (such as headphone, EarPods and many more)), where we moved the old application which was based on angularjs1.x to Angular 11. We were responsible for implementing the Business logic, integration of rest API’s, validations, oops, unit testing (Jasmine Karma), hicharts."
    },
    {
      "personUid": "RS-1",
      "uid": "work-exp-1",
      "companyName": "Wipro Ltd",
      "tenure": "October 2019 - August 2021",
      "desc": "As an Angular Developer, my responsibility is to implement Business Logic, Validations and integration of RestApis. \n Also Taken a responsibility as a Module Lead to make a coordination in a Team for smooth approach towards common goal of completing Module/Functionalities and UAT/SIT Releases, and also coordinate with Release Team for Deployment on SIT/UAT. \n I started as a Prototype Developer and soon moved to development and i worked on modules such as PVU, Budget, EDP and now handling DDO Modules. \n I also achieved an award for Outperformance in Q1. In PVU, I worked on a sub Module.i.e. ROP, after completing my tasks of development of screens for the same, moved to Budget, create a number of common, reusable and efficient code like common components and directives for faster and more efficient way of development to reduce the development time and complexity, then moved to EDP and given the task to complete workflow integration and resolving bugs towards UAT sign off and then given a responsibility of Module Lead in DDO Module to make a coordination and to contribute towards the completion of Module and subsequently approaching towards SIT and then UAT Release. \n To handle similar looking screens but with different functionality and behaviour using configuration layer, created each section as separate components and also a common configuration component and container that handles all the different child components. \nThe Configuration was created to handle the behaviour of different screens such as default fields values, remove some fields and add some fields, remove section and add section, changing the contents of DOM. A Configuration service layer is also created to dynamically change the configuration to handle behaviour of view and edit case and fields validation and access. Also, Implemented oops such as encapsulation, abstraction and inheritance and also reduce the code redundancy to a large extent. \n Implemented a robust validation for both save as draft and submit case. \n Properly modelling of data and created a complete module structure from scratch. \n Due to the implementation of common code Structure, the development time is reduced and making use of oops, created a structure that enables reducing of errors/bugs and easy to debug. Using debugging techniques, resolve the SIT bugs to enable faster releases and making the code bugs/errors free. Also implemented the State management system in the service layer using rxjs Behavioural Subject. \n I also take Technical Rounds as a part of Angular Recruitments."
    }
  ],
  "education": [
    {
      "personUid": "RS-1",
      "uid": "edu-1",
      "degree": "Bachelor of Technology",
      "major": "ECE",
      "university": "Makaut (formerly WBUT)",
      "instituteName": "Swami Vivekananda Institute of Science and Technology",
      "graduationYear": "2019",
      "grade": "7.79"
    },
    {
      "personUid": "RS-1",
      "uid": "edu-2",
      "degree": "12th Standard",
      "major": "Science",
      "university": "CBSE",
      "instituteName": "Tender Heart Senior Secondary School",
      "graduationYear": "2014",
      "grade": "72.20%"
    },
    {
      "personUid": "RS-1",
      "uid": "edu-2",
      "degree": "10th Standard",
      "major": "",
      "university": "CBSE",
      "instituteName": "D.A.V Hehal",
      "graduationYear": "2012",
      "grade": "8.6"
    }
  ],
  "skills": [
    {
      "personUid": "RS-1",
      "uid": "skill-1",
      "skill": "Angular",
      "proficeincy": 90
    },
    {
      "personUid": "RS-1",
      "uid": "skill-2",
      "skill": "HTML",
      "proficeincy": 80
    },
    {
      "personUid": "RS-1",
      "uid": "skill-3",
      "skill": "CSS",
      "proficeincy": 75
    },
    {
      "personUid": "RS-1",
      "uid": "skill-4",
      "skill": "TypeScript",
      "proficeincy": 90
    },
    {
      "personUid": "RS-1",
      "uid": "skill-4",
      "skill": "RxJs",
      "proficeincy": 85
    },
    {
      "personUid": "RS-1",
      "uid": "skill-4",
      "skill": "JavaScript",
      "proficeincy": 65
    }
  ]
}